# PART 2: SQLite

Export the country club data from PHPMyAdmin, and connect to a local SQLite instance from Jupyter notebook 
for the following questions.

In [1]:
from sqlalchemy import create_engine
import pandas as pd

#engine = create_engine("mysql://student:learn_sql%40springboard@https://sql.springboard.com/country_club",echo = True)
engine = create_engine('sqlite:///country_club.sqlite')

QUESTIONS:


## Q10: Produce a list of facilities with a total revenue less than 1000.
Output facility name and total revenue, sorted by revenue.

Remember that there's a different cost for guests and members!

In [2]:
with engine.connect() as con:
    rs = con.execute('SELECT facid, name, membercost, guestcost \
                     FROM Facilities')
    fac = pd.DataFrame(rs.fetchall(), columns=rs.keys())
    fac = fac.melt(id_vars=['facid', 'name'],  var_name='rate_tier', value_name='rate')
    rs = con.execute('SELECT facid, memid, slots FROM Bookings')
    bks = pd.DataFrame(rs.fetchall(), columns=rs.keys())
    bks['rate_tier'] = bks.memid.map(lambda x : 'guestcost' if x == 0 else 'membercost')

In [3]:
df = bks.merge(fac, on=['facid', 'rate_tier'])
df['revenue'] = df.slots * df.rate
df.loc[df.rate_tier == 'guestcost', ['name', 'revenue']].groupby('name').sum().sort_values(by='revenue', ascending=False)

                 revenue
name
Massage Room 1   41600.0
Massage Room 2   13920.0
Squash Court     12005.0
Tennis Court 2    9900.0
Tennis Court 1    9075.0
Badminton Court   1906.5
Pool Table         270.0
Snooker Table      240.0
Table Tennis       180.0



---
## Q11: Produce a report of members and who recommended them in alphabetic surname, firstname order

In [4]:
mbr = pd.read_sql_query('SELECT memid, surname, firstname, recommendedby FROM Members', engine)
mbr.memid = mbr.memid.astype(str) # workaround to enable joining memid with recommendedby

In [5]:
rcmd = mbr.copy()
rcmd['recommendedby'] = rcmd.firstname + ' ' + rcmd.surname

In [6]:
rs = mbr.merge(rcmd[['memid', 'recommendedby']], left_on='recommendedby', right_on='memid', how='left')
rs[['surname', 'firstname', 'recommendedby_y']].rename(columns={'recommendedby_y':'recommendedby'}).sort_values(by=['surname', 'firstname'])

              surname  firstname      recommendedby
15              Bader   Florence    Ponder Stibbons
12              Baker       Anne    Ponder Stibbons
16              Baker    Timothy     Jemima Farrell
8              Boothe        Tim         Tim Rownam
5             Butters     Gerald       Darren Smith
20             Coplin       Joan      Timothy Baker
29            Crumpet      Erica        Tracy Smith
7                Dare      Nancy    Janice Joplette
24            Farrell      David                NaN
13            Farrell     Jemima                NaN
0               GUEST      GUEST                NaN
18            Genting    Matthew     Gerald Butters
28               Hunt       John  Millicent Purview
11              Jones      David    Janice Joplette
22              Jones    Douglas        David Jones
4            Joplette     Janice       Darren Smith
19          Mackenzie       Anna       Darren Smith
10               Owen    Charles       Darren Smith
17             Pinker      David     Jemima Farrell
26            Purview  Millicent        Tracy Smith
3              Rownam        Tim                NaN
23             Rumney  Henrietta    Matthew Genting
21             Sarwin  Ramnaresh     Florence Bader
1               Smith     Darren                NaN
30              Smith     Darren                NaN
14              Smith       Jack       Darren Smith
2               Smith      Tracy                NaN
9            Stibbons     Ponder       Burton Tracy
6               Tracy     Burton                NaN
27         Tupperware   Hyacinth                NaN
25  Worthington-Smyth      Henry        Tracy Smith

---
## Q12: Find the facilities with their usage by member (no guests)

In [7]:
bks = pd.read_sql_query('SELECT * FROM Bookings WHERE memid != 0', engine)
bks.starttime = pd.to_datetime(bks.starttime)
mbr = pd.read_sql_query('SELECT memid, firstname || " " || surname as member FROM Members', engine)
fac = pd.read_sql_query('SELECT *, name as facility FROM Facilities', engine)

In [8]:
bks[['memid','facid', 'slots']].merge(mbr, on='memid').merge(fac[['facid', 'facility']], on='facid').pivot_table(index=['facility', 'member'], values=['slots'], aggfunc='sum')

                                  slots
facility        member
Badminton Court Anna Mackenzie       96
                Anne Baker           30
                Burton Tracy          6
                Charles Owen         18
                Darren Smith        432
...                                 ...
Tennis Court 2  Ramnaresh Sarwin     36
                Tim Boothe          168
                Tim Rownam           18
                Timothy Baker        21
                Tracy Smith           6

[202 rows x 1 columns]

---
## Q13: Find the facilities usage by month (no guests)

In [9]:
bks['month'] = bks.starttime.dt.month
bks[['month','facid', 'slots']].groupby(['month', 'facid']).sum() \
    .reset_index().merge(fac[['facid', 'facility']], on='facid').set_index(['facility', 'month']) \
    .sort_values(by=['facility', 'month']).drop(['facid'], axis=1)

                       slots
facility        month
Badminton Court 7        165
                8        414
                9        507
Massage Room 1  7        166
                8        316
                9        402
Massage Room 2  7          8
                8         18
                9         28
Pool Table      7        110
                8        303
                9        443
Snooker Table   7        140
                8        316
                9        404
Squash Court    7         50
                8        184
                9        184
Table Tennis    7         98
                8        296
                9        400
Tennis Court 1  7        201
                8        339
                9        417
Tennis Court 2  7        123
                8        345
                9        414

---
## Note
to-do: look into `pd.Grouper(freq="M")` as a different approach